app/Controllers/Admins/AdminsController.php

    public function displayApps()
    {
        $session = session();
        $apps = new ApplyedJob();
        $allApps = $apps->findAll();
---
SELECT *
FROM `applyedjobs`

    public function deleteApps($id)
    {
        $app = new ApplyedJob();
        $appDelete = $app->find($id);

        if (file_exists("public/assets/cvs/" . $appDelete["cv"])) {

            unlink("public/assets/cvs/" . $appDelete["cv"]);
        }
        $app->delete($id);
---
SELECT *
FROM `applyedjobs`
WHERE `applyedjobs`.`id` = '10'
DELETE FROM `applyedjobs`
WHERE `id` IN ('9')