app/Controllers/Jobs/JobsController.php

SELECT *
FROM `categories`
---
    public function singleJob($id): ?string
    {



        $job = new Job();
        $singleJob = $job->find($id);

        // displaying related jobs
        $relatedJobs = $this->db->query("SELECT * FROM jobs WHERE
                       id != {$id} AND category = '{$singleJob['category']}'
                        ORDER BY id DESC LIMIT 5")->getResult();


        $numRelatedJobs = $this->db->table("jobs")->where("id!=", $id)
            ->where('category', $singleJob['category'])->countAllResults();


        // categories
        $categories = new Category();
        $allcategories = $categories->findAll();

INSERT INTO `applyedjobs` (`user_id`, `company_image`, `title`, `company_name`, `location`, `job_type`, `job_id`, `cv`, `job_title`, `email`) VALUES (1, 'job_logo_5.jpg', 'Product Designer', 'Puma', 'New York City', 'Full Time', '1', 'cv.pdf', 'Web Designer', 'admin@email.com')
---
    public function applyJobs($id)
    {
        if (!isset(auth()->user()->id)) {
            return redirect()->to(base_url());
        }
        $applyedJob = new ApplyedJob();

        $data = [
            "user_id" => auth()->user()->id,
            "company_image" => $this->request->getPost('company_image'),
            "title" => $this->request->getPost('title'),
            "company_name" => $this->request->getPost('company_name'),
            "location" => $this->request->getPost('location'),
            "job_type" => $this->request->getPost('job_type'),
            "job_id" => $this->request->getPost('job_id'),
            "cv" => $this->request->getPost('cv'),
            "job_title" => $this->request->getPost('job_title'),
            "email" => auth()->user()->email
        ];

        if ($this->request->getPost('job_title') == "No job title" || $this->request->getPost('cv') == "CV not uploaded yet") {
            return redirect()->to(base_url('jobs/single-jobs/' . $id))->with('error', 'update your job title or CV');
        } else {
            $applyedJob->save($data);